Repository: leac/pelepay-form-inserter
Catalog: languages/pelepay-form-inserter-*.po
Languages: he_il

source: Choose page to redirect
he_il: בחר עמוד עקרונות

source: Add Pelepay form
he_il: הוסף טופס תשלום

source: First option text
he_il: מה שיהיה כתוב כשהקומבו סגור

source: Comma separated price list
he_il: רשימת מחירים, מופרדת ע''י פסיקים (למשל 250,300,350)

source: Comma separated price text list
he_il: רשימת טקסטים, מופרדת ע''י פסיקים, הנלווים לכל מחיר (למשל מחיר לחבר,מחיר לשאינו חבר,מחיר לחייזר)

source: Payment for...
he_il: תרומה בעבור

source: Max number of payments
he_il: מספר תשלומים מקסימלי

source: No amount chosen
he_il: לא נבחר סכום לתשלום

source: Click here to choose sum
he_il: לחצו כאן לבחירת הסכום

source: I read the principles
he_il: קראתי את העקרונות ואפעל על פיהם

source: Go on to pay
he_il: המשך לתשלום

source: Pages:
he_il: עמודים:

source: Edit
he_il: עריכה
